[
  {
    "projectID": "bpa",
    "heading": "Drug & Adverse Reaction Information",
    "subheading": "BPA Agile Hackathon Winner for company contract",
    "mainImg": "img/bpa.png",
    "mainDescription": "The week long agile hackathon of 200 companies was a competition for the best prototype utilizing a public dataset which was determined by the final MVP, agile development cycles, and user-centered design processes. My roles were the primary UI/UX designer and front-end web developer. We built the UI using Bootstrap and the front-end framework using AngularJS. The web app consumes public available datasets from open.fda.gov about drugs and adverse events to provide users with important information about reactions to prescription drugs.",
    "hashtags": [
      "#HTML/CSS", "#Angular", "#Agile", "#Javascript", "#datavisualizations"
    ],
    "designURL": "#/bpa",
    "hasGithubURL": "true",
    "hasProjectURL": "false",
    "githubURL": "https://github.com/TFlowGit/tf-ads-bpa",
    "designImg": "img/bpa-desktop.png",
    "role": "UI/UX Designer and Front End Developer",
    "tools": "whiteboard, pen & paper, bootstrap, angularjs ",
    "brief": "DARI is TechFlow's MVP (Minimal Viable Product) submission to 18F Consulting's Agile BPA (Blanket Purchase Agreement) Hackathon utilizing FDA's public datasets.",
    "deliverables": ["MVP utilizing openFDA's API to provide a web service", "documentation of Agile approach", "documentation of UX design process", "Agile outline for one product increment"],
    "goals": ["implement query or look-up based service", "visualize adverse event statistics with interactivity", "maintain the recognizable design or look of a traditional drug label"],
    "designProcess":[
      {
          "heading": "AGILE APPROACH",
          "img": "img/bpa-sprintcycle.png",
          "paragraph": "Our Agile team of about 15 employees at TechFlow each held specific responsibilities to deliver a working prototype using datasets from openFDA.gov. Below outlines the 7 stages of the Agile Approach which was carried out in a week and a half. The github repo outlines the approach in further detail.",
          "subheadings": [
            {
              "heading": "Stage 1: Vision",
              "img": "true",
              "paragraph": "The first meeting the team accomplished several visionary goals - determining how the FDA data will be employed, establishing user personas, identifying human centered design features that would be useful and appealing, and definining the technical architecture."
            },
            {
              "heading": "Stage 2: Product Roadmap",
              "img": "true",
              "paragraph": "After the visionary meeting, the team defined the MVP, drafted the roadmap for the features to be implemented for the week, finalized user stories, prioritized backlog, and setup the technical environment (AWS and github accounts)."
            },
            {
              "heading": "Stage 3: Release Planning",
              "img": "true",
              "paragraph": "At this stage, we refined the roadmap for features based on team capability, planned the test development approach used to validate user stories, scheduled 2 releases into production, and finalized the Definition of Done for each deliverable."
            },
            {
              "heading": "Stage 4: Sprint Planning",
              "img": "true",
              "paragraph": "We narrowed down the iterative approach which included 2 sprints focused on the highest priority features. Based on these 2 sprints, the sprint backlog was updated with clearer tasks for the week, specific user stories for the MVP were identified for the current backlog as well as the next production increment, and previous environment issues were resolved."
            },
            {
              "heading": "Stage 5: Daily Scrum",
              "img": "true",
              "paragraph": "Led by the scrum master, our 15 minute daily scrums were crucial in the design and development of the prototype. Each meeting, the team identified completed items from the previous day, discussed blockers, and communicated other concerns related to project coordination."
            },
            {
              "heading": "Stage 6: Sprint Review",
              "img": "true",
              "paragraph": "The two sprint review meetings ensured that the prototype had reached the goals for that sprint in accordance to the user stories and goals. The feedback from the User Acceptance Testing(UAT) determined whether the product owner would approve of the progress as it met the criteria."
            },
            {
              "heading": "Stage 7: Sprint Retrospective",
              "img": "true",
              "paragraph": "This stage differs from Sprint Review because the main goal is to assess the processes and performance of the scrum team. An example of the questions asked at this meeting is - Did we meet our expected results? We looked at the sprint burn-down to compare planned versus actual work accomplished."
            }
          ]
      },
      {
          "heading": "MY TAKEAWAYS",
          "paragraph": "The BPA Hackathon was my favorite experience during my summer internship at TechFlow. While our development team followed the Agile methodologies, the hackathon exposed me to all parts of the Agile methods that I was often not part of in the regular environment. Although I was an intern, the scrum team assigned me the primary UI designer which proved to be quite challenging given the numerous development and time constraints. I was the primary HTML/CSS developer, with some Angular tasks used in the consumption and rendering of the data passed from the API. With this primary role, I worked closely with the product owner and business analysts who provided me guidance in creating the paper or whiteboard prototypes.  ",
          "subheadings": [
            {
              "heading": "User Testing and Consistency",
              "img": "true",
              "paragraph": "Although I was involved in the user story and persona creation, not being involved in the user testing strained my understanding of the end user. The most crucial design flaw from the first sprint arose from one of the UAT (user acceptance testing) from a participant related to the pharmaceutical business. The Drug Information portion displayed generic and warning information on a split screen, but the aesthetic decisions were not as recognizable or similar to a drug label seen on most bottles. From UAT, the user testers gathered the importance of such recognition, that often users look in the same area of the drug label for specific information, such as allergies. This delay of information from user testers to designers almost costed a full day work. Additionally, as the lead UX designer, not being able to ask the necessary followup questions within the same context of user testing may have affected the usability of the final prototype. With a service that deals with prescription drugs, even the smallest design decisions could be threatening. Consistency with labeling conventions is crucial to uphold for users that need this information to make health decisions."
            }
          ],
          "img": "true"
      }
    ]
  },
  {
    "projectID": "sdms",
    "heading": "San Diego Music Studio",
    "subheading": "A redesign of a local business website",
    "mainImg": "img/sdms.png",
    "mainDescription": "This local, small business is well-established in the music community both online in ecommerce and in the greater San Diego area. With the growing client base, their website at the time was not at the Google SEO's standards, and more importantly, was not user friendly. I redesigned and developed their studio website to showcase their music teachers, a new brand, and reduce their content to the necessities. The website is now more readible, integrated with their facebook site, and much easier to maintain for the manager.",
    "hashtags": [
      "#HTML/CSS", "#Javascript", "#freelancework", "#prototyping"
    ],
    "designURL": "#/sdms",
    "hasProjectURL": "true",
    "projectURL": "http://sandiegomusicstudio.com/",
    "hasGithubURL": "true",
    "githubURL": "https://github.com/andrianabeltran/SDMSDesign",
    "designImg": "img/sdms-desktop.png",
    "role": "UI/UX Designer and Front End Developer",
    "tools": "sketchbook & pens, bootstrap, less",
    "brief": "The reponsive website of San Diego Music Studio (SDMS) is a complete redesign of their studio website that provides information about staff, music lessons, and rentals.",
    "deliverables": [ "specified menu items and features given by manager","instructor biographies", "facebook feed", "google map integration", "quick rentals of popular items"],
    "goals": ["minimize content from existing website", "demonstrate a family-friendly, local business brand", "show SDMS as a prominent presence in music community"],
    "designProcess":[
      {
          "heading": "EVALUATION OF PREVIOUS WEBSITE",
          "img": "true",
          "paragraph": "The previous website also served as an ecommerce business for their music instruments, sheets, and accessories. The store manager wanted two separate sites for the store and online supply business, so the San Diego Music Store website would showcase only a fraction of what the previous website had. Several design flaws of the current website concerned the navigation of the ecommerce portion of the website because of the amount of content and multiple user flows.",
          "subheadings": [
            {
              "heading": "Not Responsive",
              "img": "true",
              "paragraph": "The previous site was not adaptive to mobile views, making it much more difficult for users to navigate the site. If the user wanted to get anywhere deeper in the site, the search was at corner of the page while the side menu was on the opposite side, which did not fit in the screen for any resolution smaller than a normal desktop. Adaptiveness is also a Google standard, so to improve SEO it was crucial to make the site mobile-first."
            },
            {
              "heading": "No Defining Brand",
              "img": "true",
              "paragraph": "The clutter and lack of color (or even whitespace) was not only overwhelming to the eye, but did not serve to emote or represent any sort of brand of the studio. "
            },
            {
              "heading": "Not Readable",
              "img": "true",
              "paragraph": "At every level of the website, the font, use of white space, and images did not draw the user to any center of attention. A page should effectively draw the users attention with actionable purpose."
            }
          ]
      },
      {
          "heading": "REPURPOSING THE WEBSITE",
          "img": "true",
          "paragraph": "The main deliverables were provided by the store manager. The purpose of this website would be only for the studio so this gave room to add some design and graphics that would contribute to the overall welcoming, family-friendly look of the website. The color palette I chose was fiting for a this new brand which the client was pleased about. The current menu items were also given by the store manager which basically dictated the entire site flow. "
      },
      {
          "heading": "MY TAKEAWAYS",
          "paragraph": "As a freelancer, this was the first project for a client in which I had to develop a completely new website, and while very eager to practice all the UX research and usability evaluations I learned in school, the design and implementation process proved much more different than expected. The most important take away working as a freelancer is 'Time Is Money' - designing and developing under the constraint of small budget often causes a lot of shortcuts in the design process to make clients happy.",
          "img": "true",
          "subheadings": [
            {
              "heading": "Freelancing Can Be Messy & Clients Don't Know What They Want",
              "img": "true",
              "paragraph": "With a very tight budget and time schedule, communicating what needs to be done and estimating the work time proved to be difficult. Since this was my first client, I simply did my best work in the amount of time I had, without suggesting and pushing for certain design choices that would have improved the brand and usability. Clients might not know what's best, even if it means trying to convince them to spend more time on developing useful features or refining the design."
            },
            {
              "heading": "High Fidelity Prototypes Would Have Been Nice",
              "img": "true",
              "paragraph": "Again, with the time crunch I only managed to get rough paper prototypes of the site which doesn't have much depth to it. The most convincing way to get a client on board with a design suggestion is to provide both low and high fidelity prototypes. Better communication could have made for a better aesthetic of the site and bulking up the content of the website perhaps if I had provided a clearer design vision for the client. Prototypes can communicate ideas to move forward in development and convince clients that spending more time is worth it. This makes for great business on both ends."
            },
            {
              "heading": "Technical Architecture Should Be Optimized For Client Management",
              "img": "true",
              "paragraph": "From a coding perspective, if the client wanted to make the weebsite dynamic later down the road, then the framework would have to be restructured. There are technologies I could have considered to make the management of the content easier, for example using JSON to pass data and using Handlebars or Angular to render it on the front end."
            }
          ]
      }
    ]
  },
  {
    "projectID": "collide",
    "heading": "Collide SD",
    "subheading": "Data visualization of the effects of gentrification",
    "mainImg": "img/gentrif.png",
    "mainDescription": "Utilizing the Delphi public dataset and d3.js data visualization library, out team developed a platform that consumed relevant demographic information about several areas in San Diego to demonstrate the effects of gentrification. I contributed to most of the low and high fidelity prototypes, design documentation, and the UI of the website. The main objective of this assignment was to create useful meaning from Delphi's public dataset and to provide interactive visualization of the information. ",
    "hashtags": [
      "#HTML/CSS", "#Javascript", "#datamining", "#d3js", "#paperprototyping", "#Axure"
    ],
    "designURL": "#/gentrif",
    "hasProjectURL": "true",
    "projectURL": "http://sd-gentrif.herokuapp.com/",
    "hasGithubURL": "true",
    "githubURL": "https://github.com/andrianabeltran/gentrif-website",
    "designImg": "img/gentrif-desktop.png",
    "role": "UX Designer",
    "tools": "pen & paper, Axure, bootstrap",
    "brief": "A web platform that consumes demographic information in San Diego to demonstrate the effects of gentrification through interactive visualizations.",
    "deliverables": ["web service utilizing demographic statistics San Diego public datasets", "implement d3js visualizations", "use MongoDB, Node, Handlebars, Express as environment"],
    "goals": ["create low and high fidelity protoypes on Axure", "bring awareness to the gentrification issue", "display the relevant statistics through a digestable interface"],
    "designProcess":[
      {
          "heading": "EVALUATE DATASETS AND IDEATION",
          "img": "true",
          "paragraph": ""
      },
      {
          "heading": "heading 2",
          "img": "true",
          "paragraph": ""
      }
    ]
  },
  {
    "projectID": "ourucsd",
    "heading": "OurUCSD",
    "subheading": "A campaign challenging UCSD's educational environment",
    "mainImg": "img/ourucsd.png",
    "mainDescription": "This critical design project challenges students to question the current educational structure here at UCSD. The campaign is composed of physical and web media serving as propoganda for a revolutionized campus. This included large banners placed on hallmarks around campus, posters, fliers, and a website. The website plays off of a futuristic utopian school system. It is presented as if it has already happened. The website demonstrates the three different phases our ideal school would have. It also provides a google doc where students can voice their own questions about the current educational structure. ",
    "hashtags": [
      "#UX", "#CriticalDesign", "#ideation", "#prototyping", "#UserResearch", "#IssueMapping", "#DesignInEducation", "#HTML/CSS"
    ],
    "designURL": "#/ourucsd",
    "hasProjectURL": "false",
    "hasGithubURL": "false",
    "designProcess":[
      {
          "heading": "heading 1",
          "description": "description"
      },
      {
          "heading": "heading 2",
          "description": "description"
      }
    ]
  },
  {
    "projectID": "portfolio",
    "heading": "andrianaromero@herokuapp.com",
    "subheading": "Portfolio website showcasing my CS and UX work",
    "mainImg": "img/portfolio.png",
    "mainDescription": "This is my personal portfolio that showcases my past work and projects. Designed on low and high fidelity prototypes, my website's color palette, fonts, and other design attributes exhibit my personality. To showcase my front end development skills, this website is fully developed with AngularJS and deployed on Heroku. Feel free to browse my github to examine the framework and code.",
    "hashtags": [
      "#Angular","#UX", "#lowfi", "#highfi", "#HTML/CSS", "#Javascript", "#Adobe Illustrator"
    ],
    "designURL": "#/portfolio",
    "hasGithubURL": "true",
    "githubURL": "https://github.com/andrianabeltran/myportfolio/",
    "designProcess":[
      {
          "heading": "heading 1",
          "description": "description"
      },
      {
          "heading": "heading 2",
          "description": "description"
      }
    ]
  },
  {
    "projectID": "uofl",
    "heading": "University of Leicester",
    "subheading": "Usability Evaluation and Redesign",
    "mainImg": "img/uofl.png",
    "mainDescription": "University websites like the 2013 version of University of Leicester's website can have up to dozens to hundreds of levels in their navigation or architecture. With several different user personas mapped to an even larger set of user end goals, identifying and prioritizing user stories often becomes difficult to weigh. This 5 week project consisted of several different usability evaluations of the university website, restructuring of the information architecture based on these results, and a final redesign/implementation of the website down to 3 navigation levels.",
    "hashtags": [
      "#InformationArchitecture", "#Usability", "#HTML/CSS", "#UserStories", "#UseCases",  "#CompAnalysis"
    ],
    "designURL": "#/uofl",
    "hasGithubURL": "false",
    "hasProjectURL": "true",
    "projectURL": "uofleicester/index.html",
    "githubURL": "https://github.com/TFlowGit/tf-ads-bpa",
    "designImg": "img/uofl-desktop.png",
    "role": "UI/UX Designer",
    "tools": "pen & paper, Illustrator ",
    "brief": "",
    "deliverables": ["MVP utilizing openFDA's API to provide a web service", "documentation of Agile approach", "documentation of UX design process", "Agile outline for one product increment"],
    "goals": ["implement query or look-up based service", "visualize adverse event statistics with interactivity", "maintain the recognizable design or look of a traditional drug label"],
    "designProcess":[
      {
          "heading": "AGILE APPROACH",
          "img": "img/bpa-sprintcycle.png",
          "paragraph": "Our Agile team of about 15 employees at TechFlow each held specific responsibilities to deliver a working prototype using datasets from openFDA.gov. Below outlines the 7 stages of the Agile Approach which was carried out in a week and a half. The github repo outlines the approach in further detail.",
          "subheadings": [
            {
              "heading": "Stage 1: Vision",
              "img": "true",
              "paragraph": "The first meeting the team accomplished several visionary goals - determining how the FDA data will be employed, establishing user personas, identifying human centered design features that would be useful and appealing, and definining the technical architecture."
            },
            {
              "heading": "Stage 2: Product Roadmap",
              "img": "true",
              "paragraph": "After the visionary meeting, the team defined the MVP, drafted the roadmap for the features to be implemented for the week, finalized user stories, prioritized backlog, and setup the technical environment (AWS and github accounts)."
            },
            {
              "heading": "Stage 3: Release Planning",
              "img": "true",
              "paragraph": "At this stage, we refined the roadmap for features based on team capability, planned the test development approach used to validate user stories, scheduled 2 releases into production, and finalized the Definition of Done for each deliverable."
            },
            {
              "heading": "Stage 4: Sprint Planning",
              "img": "true",
              "paragraph": "We narrowed down the iterative approach which included 2 sprints focused on the highest priority features. Based on these 2 sprints, the sprint backlog was updated with clearer tasks for the week, specific user stories for the MVP were identified for the current backlog as well as the next production increment, and previous environment issues were resolved."
            },
            {
              "heading": "Stage 5: Daily Scrum",
              "img": "true",
              "paragraph": "Led by the scrum master, our 15 minute daily scrums were crucial in the design and development of the prototype. Each meeting, the team identified completed items from the previous day, discussed blockers, and communicated other concerns related to project coordination."
            },
            {
              "heading": "Stage 6: Sprint Review",
              "img": "true",
              "paragraph": "The two sprint review meetings ensured that the prototype had reached the goals for that sprint in accordance to the user stories and goals. The feedback from the User Acceptance Testing(UAT) determined whether the product owner would approve of the progress as it met the criteria."
            },
            {
              "heading": "Stage 7: Sprint Retrospective",
              "img": "true",
              "paragraph": "This stage differs from Sprint Review because the main goal is to assess the processes and performance of the scrum team. An example of the questions asked at this meeting is - Did we meet our expected results? We looked at the sprint burn-down to compare planned versus actual work accomplished."
            }
          ]
      },
      {
          "heading": "MY TAKEAWAYS",
          "paragraph": "The BPA Hackathon was my favorite experience during my summer internship at TechFlow. While our development team followed the Agile methodologies, the hackathon exposed me to all parts of the Agile methods that I was often not part of in the regular environment. Although I was an intern, the scrum team assigned me the primary UI designer which proved to be quite challenging given the numerous development and time constraints. With this primary role, I worked closely with the product owner and business analysts who provided me guidance in creating the paper or whiteboard prototypes. Although I was involved in the user story and persona creation, not being involved in the user testing strained my understanding of the end user. I was the primary HTML/CSS developer, with some Angular tasks used in the consumption and rendering of the data passed from the API.  ",
          "img": "true"
      }
    ]
  }
]
